# Assignment 3 "SQL Queries"

This assignment is based on Chapters 2 and 4 in John L. Viesca's "SQL Queries for Mere Mortals."

### Connect to the database server

In [1]:
import json
import pymysql 

pymysql.install_as_MySQLdb()

with open('cred.json') as f:
    creds = json.load(f)

connection_string = "mysql://{user}:{password}@{host}".format(**creds)

In [2]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql $connection_string

'Connected: dimitri@None'

### Show all available databases

Note the shared schemas `shared_bowling`, `shared_sales`, `shared_recipes`, `schared_schedule`, and `shared_entertain`.

Review their [Diagrams](https://github.com/msds-5315/Database-Systems-for-Data-Science/blob/master/Schemas.pdf) and use it to understand the relationships between entities in each database as reviewed in class.

In [3]:
%%sql

SHOW DATABASES;

 * mysql://dimitri:***@db.data-science-ust.net
12 rows affected.

[('information_schema',),
 ('dimitri_enroll',),
 ('dimitri_hw2',),
 ('dimitri_recipes',),
 ('dimitri_uni',),
 ('dimitri_university',),
 ('shared_bowling',),
 ('shared_entertain',),
 ('shared_recipes',),
 ('shared_sales',),
 ('shared_schedule',),
 ('shared_uni',)]

## List tables in a given schema

In [ ]:
%%sql

SHOW TABLES IN shared_sales;

### Ispect the definition of a given tables

In [ ]:
%%sql

SHOW CREATE TABLE shared_sales.order_details;

You can also retreive the output into a python object for nicer printing. Just use a single percent sign `%sql` rather than two `%%sql`

In [ ]:
%%timeit -n 1 -r 1
result = %sql SHOW CREATE TABLE shared_sales.order_details;

In [ ]:
print(result[0]['Create Table'])

Review the table declarations and compare them to the schema diagrams.

# Simple queries from Chapter 4

Which cities do our customers live in?

In [ ]:
%%sql
USE shared_sales;

SHOW TABLES;

In [ ]:
%%sql 
-- Which cities do our customers live in?

SELECT CustCity FROM customers;

In [ ]:
%%sql

-- What are the names and addresses of all our employees

SELECT EmpFirstName, EmpLastName, EmpStreetAddress 
    FROM employees;

In [ ]:
%%sql

SELECT * FROM employees;

In [ ]:
%%sql

USE shared_schedule;

show tables;

In [ ]:
%%sql

SELECT * FROM Subjects;

In [ ]:
%%sql

-- What Categories of classes do we offer

SELECT DISTINCT CategoryID FROM Subjects;

In [ ]:
%%sql

USE shared_bowling;

In [ ]:
%%sql

SHOW TABLES

In [ ]:
%%sql

SELECT * FROM Bowlers;

In [ ]:
%%sql

-- Which cities are represented by our bowling league membership?

SELECT DISTINCT BowlerCity, BowlerState FROM Bowlers;

In [ ]:
%%sql

USE shared_sales;

SHOW TABLES;

In [ ]:
%%sql

SELECT * FROM vendors;

In [ ]:
%%sql

-- List vendors in zipcode order

SELECT VendName, VendZipCode 
    FROM vendors
    ORDER BY VendZipCode

In [ ]:
%%sql

SELECT *
    FROM products;

In [ ]:
%%sql

-- What are the names and prices of our products?

SELECT ProductName, RetailPrice
    FROM products

# Problems to Solve

In [ ]:
%%sql

SHOW SCHEMAS LIKE "shared%"

## Sales database `shared_sales`

**Problem 1**. (`shared_sales`) *Show all information on our employees.*

**Problem 2.** (`shared_sales`) Show vendor names and their cities, sorted by city.

## Entertainment database `shared_entertain`

**Problem 3.** Give the names and phone numbers of all agents ordered by last name/first name.

**Problem 4.** Give me the information on all our engagements

**Problem 5.** List all engagements and their start dates, sort by date in descending order and by engagement in ascending order.

## School Scheduling Database `shared_schedule`

**Problem 6**. Show the subjects

**Problem 7.** What kinds of titles are associated with our faculty

In [13]:
%%sql

SELECT DISTINCT Title, Status 
    FROM Faculty 
    ORDER BY Title

 * mysql://dimitri:***@db.data-science-ust.net
5 rows affected.

[('Associate Professor', 'Full Time'),
 ('Associate Professor', 'On Leave'),
 ('Instructor', 'Full Time'),
 ('Instructor', 'Part Time'),
 ('Professor', 'Full Time')]

In [15]:
%%sql

SELECT * FROM Faculty LIMIT 3

 * mysql://dimitri:***@db.data-science-ust.net
3 rows affected.

[(98005, 'Instructor', 'Full Time', b'\x01'),
 (98007, 'Associate Professor', 'Full Time', b'\x01'),
 (98010, 'Associate Professor', 'On Leave', b'\x01')]

**Problem 8.** List the names and phone numbers of all our staff, sorted by last name/first name.

In [18]:
%%sql

SELECT * FROM Staff

 * mysql://dimitri:***@db.data-science-ust.net
27 rows affected.

[(98005, 'Suzanne', 'Viescas', '15127 NE 24th, #383', 'Redmond', 'WA', '98052', '425', '555-2686', Decimal('44000.00'), datetime.date(1994, 5, 31), 'Faculty'),
 (98007, 'Gary', 'Hallmark', 'Route 2, Box 203B', 'Auburn', 'WA', '98002', '253', '555-2676', Decimal('53000.00'), datetime.date(1993, 1, 21), 'Faculty'),
 (98010, 'Jeffrey', 'Smith', '30301 - 166th Ave. N.E.', 'Fremont', 'CA', '94538', '510', '555-2596', Decimal('52000.00'), datetime.date(1991, 10, 6), 'Faculty'),
 (98011, 'Ann', 'Patterson', '16 Maple Lane', 'Auburn', 'WA', '98002', '253', '555-2591', Decimal('45000.00'), datetime.date(1991, 10, 16), 'Faculty'),
 (98012, 'Robert', 'Brown', '672 Lamont Ave', 'Houston', 'TX', '77201', '713', '555-2491', Decimal('49000.00'), datetime.date(1997, 2, 9), 'Faculty'),
 (98013, 'Deb', 'Waldal', '908 W. Capital Way', 'Tacoma', 'WA', '98413', '253', '555-2496', Decimal('44000.00'), datetime.date(1994, 7, 5), 'Faculty'),
 (98014, 'Peter', 'Brehm', '722 Moss Bay Blvd.', 'Kirkland', 'WA', '98033', '425', '555-2501', Decimal('60000.00'), datetime.date(1994, 7, 16), 'Faculty'),
 (98019, 'Mariya', 'Sergienko', '901 Pine Avenue', 'Portland', 'OR', '97208', '503', '555-2526', Decimal('45000.00'), datetime.date(1997, 11, 2), 'Faculty'),
 (98020, 'Jim', 'Glynn', '13920 S.E. 40th Street', 'Bellevue', 'WA', '98009', '425', '555-2531', Decimal('45000.00'), datetime.date(1993, 8, 2), 'Faculty'),
 (98021, 'Tim', 'Smith', '30301 - 166th Ave. N.E.', 'Seattle', 'WA', '98106', '206', '555-2536', Decimal('40000.00'), datetime.date(1996, 12, 17), 'Registrar'),
 (98025, 'Carol', 'Viescas', '722 Moss Bay Blvd.', 'Kirkland', 'WA', '98033', '425', '555-2576', Decimal('50000.00'), datetime.date(1992, 4, 12), 'Faculty'),
 (98028, 'Alaina', 'Hallmark', 'Route 2, Box 203B', 'Woodinville', 'WA', '98072', '425', '555-2631', Decimal('57000.00'), datetime.date(1992, 1, 17), 'Faculty'),
 (98030, 'Liz', 'Keyser', '13920 S.E. 40th Street', 'Bellevue', 'WA', '98006', '425', '555-2556', Decimal('48000.00'), datetime.date(1996, 5, 31), 'Faculty'),
 (98036, 'Sam', 'Abolrous', '611 Alpine Drive', 'Palm Springs', 'CA', '92263', '760', '555-2611', Decimal('60000.00'), datetime.date(1990, 11, 20), 'Faculty'),
 (98040, 'Jim', 'Wilson', '101 NE 88th', 'Salem', 'OR', '97301', '503', '555-2636', Decimal('50000.00'), datetime.date(1995, 1, 13), 'Faculty'),
 (98042, 'David', 'Smith', '311 20th Ave. N.E.', 'Fremont', 'CA', '94538', '510', '555-2646', Decimal('52000.00'), datetime.date(1999, 12, 17), 'Faculty'),
 (98043, 'Kathryn', 'Patterson', '16 Maple Lane', 'Seattle', 'WA', '98115', '206', '555-2651', Decimal('25000.00'), datetime.date(1992, 11, 14), 'Secretary'),
 (98045, 'Michael', 'Hernandez', 'PO Box 223311', 'Tacoma', 'WA', '98413', '253', '555-2711', Decimal('60000.00'), datetime.date(1998, 8, 20), 'Faculty'),
 (98048, 'Joyce', 'Bonnicksen', '2424 Thames Drive', 'Bellevue', 'WA', '98006', '425', '555-2726', Decimal('60000.00'), datetime.date(1994, 3, 2), 'Faculty'),
 (98052, 'Katherine', 'Ehrlich', '777 Fenexet Blvd', 'Redmond', 'WA', '98052', '425', '555-0399', Decimal('45000.00'), datetime.date(1993, 3, 8), 'Faculty'),
 (98053, 'Caleb', 'Viescas', '4501 Wetland Road', 'Long Beach', 'CA', '90809', '562', '555-0037', Decimal('45000.00'), datetime.date(2000, 2, 10), 'Faculty'),
 (98055, 'Alastair', 'Black', '3887 Easy Street', 'Seattle', 'WA', '98125', '206', '555-0039', Decimal('60000.00'), datetime.date(1996, 12, 11), 'Faculty'),
 (98057, 'Joe', 'Rosales III', '7288 Barrister Ave N', 'Tacoma', 'WA', '98413', '253', '555-2281', Decimal('35000.00'), datetime.date(1996, 11, 25), 'Graduate Advisor'),
 (98059, 'Maria', 'Patterson', '3445 Cheyenne Road', 'El Paso', 'TX', '79993', '915', '555-2291', Decimal('48000.00'), datetime.date(1994, 9, 17), 'Faculty'),
 (98062, 'Caroline', 'Coie', '298 Forest Lane', 'Seattle', 'WA', '98125', '206', '555-2306', Decimal('52000.00'), datetime.date(1991, 1, 28), 'Faculty'),
 (98063, 'Kirk', 'DeGrasse', '455 West Palm Ave', 'San Antonio', 'TX', '78284', '210', '555-2311', Decimal('45000.00'), datetime.date(1996, 3, 2), 'Faculty'),
 (98064, 'Luke', 'Patterson', '877 145th Ave SE', 'Portland', 'OR', '97208', '503', '555-2316', Decimal('56000.00'), datetime.date(1997, 8, 20), 'Faculty')]

## Bowling league database `shared_bowling`

**Problem 9.** List the teams in alpabetical order

**Problem 10.** Show bowling score information for each of our members

**Problem 11.** Show the names and addresses of bowlers, sorted by name in alphabetical order

In [19]:
%%sql

use shared_bowling

 * mysql://dimitri:***@db.data-science-ust.net
0 rows affected.

[]

In [33]:
%%sql

SELECT * FROM Bowlers LIMIT 3

 * mysql://dimitri:***@db.data-science-ust.net
3 rows affected.

[(1, 'Fournier', 'Barbara', None, '67 Willow Drive', 'Bothell', 'WA', '98123', '(206) 555-9876', 1),
 (2, 'Fournier', 'David', None, '67 Willow Drive', 'Bothell', 'WA', '98123', '(206) 555-9876', 1),
 (3, 'Kennedy', 'John', 'A', '2957 W 33rd', 'Ballard', 'WA', '98099', '(206) 555-7854', 1)]

In [43]:
%%sql

SELECT CONCAT(BowlerLastName, ', ', BowlerFirstName, ' ', IFNULL(BowlerMiddleInit, "")) as name, BowlerAddress
    FROM Bowlers
    ORDER BY BowlerLastName ASC, BowlerLastName DESC
    LIMIT 5 OFFSET 5

 * mysql://dimitri:***@db.data-science-ust.net
5 rows affected.

[('Hallmark, Bailey ', 'Route 2, Box 203B'),
 ('Hallmark, Alaina ', 'Route 2, Box 203B'),
 ('Hallmark, Gary ', 'Route 2, Box 203B'),
 ('Hallmark, Elizabeth ', 'Route 2, Box 203B'),
 ('Hernandez, Michael ', '47 Harvard Drive')]

## Recipes database `shared_recipes`

**Problem 12.** Show all ingredients

**Problem 13.** Show all recipes sorted by recipe name